import {
  Accordion,
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@lib/helpers/accordion";

const AccordionQA = () => {
  return (
    <Accordion type="single" collapsible>
      <AccordionItem value="item-1">
        <AccordionTrigger>Πότε πρέπει να επισκεφθώ ψυχολόγο;</AccordionTrigger>
        <AccordionContent>
          <p className="py-1">
            Η ερώτηση αυτή είναι υποκειμενική καθώς δεν υπάρχει κάποια
            συγκεκριμένη στιγμή να κάνεις αυτό το βήμα. Ο κάθε άνθρωπος θα
            νιώσει την ανάγκη και θα πάει όταν θα είναι η κατάλληλη στιγμή για
            αυτόν.
          </p>
          <p className="py-1">
            Πέρα από αυτό σε περιπτώσεις που μπορεί να διαγνωσθεί μία ή παραπάνω
            ψυχιατρικές παθήσεις καλό είναι το άτομο να επισκεφθεί έναν ειδικό
            το συντομότερο.
          </p>
        </AccordionContent>
      </AccordionItem>
      <AccordionItem value="item-2">
        <AccordionTrigger>Πως θα με βοηθήσει η ψυχοθεραπεία;</AccordionTrigger>
        <AccordionContent>
          <p className="py-1">
            Η διαδικασία της ψυχοθεραπείας είναι ένας νέος δρόμος να ανακαλύψεις
            την προσωπική σου δύναμη, τα προσωπικά σου όρια, και να καταφέρεις
            να βρεις διαφορετικές διεξόδους στην καθημερινότητα σου.
          </p>
          <p className="py-1">
            Σημαντικό είναι να κρατήσουμε σαν πληροφορία ότι η διαδικασία της
            θεραπείας είναι ένα ταξίδι με τον θεραπευτή και τον θεραπευόμενο να
            είναι συνεπιβάτες σε αυτό το ταξίδι, και όχι ο θεραπευτής να
            ‘’βάλει’’ μέσα στο μυαλό του θεραπευόμενου τις λύσεις για το
            πρόβλημα.
          </p>
        </AccordionContent>
      </AccordionItem>
      <AccordionItem value="item-3">
        <AccordionTrigger>Πως να επιλέξω ψυχολόγο;</AccordionTrigger>
        <AccordionContent>
          <p className="py-1">
            Το να δημιουργηθεί μια δυνατή θεραπευτική σχέση μεταξύ του θεραπευτή
            και του θεραπευόμενου είναι το ήμισυ της θεραπείας. Η επιλογή του
            σωστού θεραπευτή σίγουρα είναι μια πολύ προσωπική διαδικασία όπου
            άλλοι επιλέγουν από τα εξωτερικά χαρακτηριστικά του θεραπευτή, άλλοι
            από το βιογραφικό του και άλλοι από τον χώρο που θα τους κάνει να
            νιώσουν άνετα και να μπορέσουν να ανοιχτούν.
          </p>
          <p className="py-1">
            Σίγουρα σημαντικό είναι να σιγουρευτούμε πρώτα για ένα επαρκές
            βιογραφικό και μια επαρκή κατάρτιση, για να μπορούμε τουλάχιστον να
            απολαύσουμε τα βασικά προνόμια της θεραπείας
          </p>
        </AccordionContent>
      </AccordionItem>
      <AccordionItem value="item-4">
        <AccordionTrigger>
          Γιατί η πρώτη συνεδρία παρέχεται δωρεάν;
        </AccordionTrigger>
        <AccordionContent>
          <p className="py-1">
            Όπως προαναφέρθηκε σημαντικό είναι για τον θεραπευόμενο να λάβει την
            κατάλληλη ενημέρωση και να δει αν του ταιριάζει η θεραπευτική
            προσέγγιση που ακολουθεί ο θεραπευτής.
          </p>
          <p className="py-1">
            Μετά από αυτήν την συνεδρία ενημέρωσης ο θεραπευόμενος μπορεί να
            αποφασίσει αν πιστεύει ότι μπορεί να τον βοηθήσει η διαδικασία και
            αν θέλει να την ακολουθήσει.
          </p>
        </AccordionContent>
      </AccordionItem>
    </Accordion>
  );
};

export default AccordionQA;
