interface Service {
  id: number;
  tags: string[];
  title: string;
  content: string;
  coupon?: string;
}

const services: Service[] = [
  {
    id: 1,
    tags: ["Συμβουλευτική", "Αυτοβελτίωση"],
    title: "Ατομική συνεδρία ψυχολογικής υποστήριξης",
    content:
      "Αυτή η υπηρεσία παρέχει ατομικές συνεδρίες με τον κλινικό ψυχολόγο, κατά τις οποίες ο πελάτης μπορεί να αναλύσει προσωπικά ζητήματα, να ανακαλύψει τα αίτια των προβλημάτων του και να αναπτύξει στρατηγικές για την αντιμετώπισή τους.",
    coupon: "-20% Online",
  },
  {
    id: 2,
    tags: ["Ψυχική υγεία", "Ψυχολογική υποστήριξη"],
    title: "Οικογενειακή θεραπεία",
    content:
      "Αυτή η υπηρεσία απευθύνεται σε οικογένειες που αντιμετωπίζουν δυσκολίες στην επικοινωνία, την αλληλεπίδραση και τις συναισθηματικές τους σχέσεις. Ο κλινικός ψυχολόγος βοηθά τα μέλη της οικογένειας να επιλύσουν διαφορές, να βελτιώσουν την επικοινωνία και να αναπτύξουν υγιείς σχέσεις.",
    coupon: "-20% Online",
  },
  {
    id: 3,
    tags: ["Ψυχοθεραπεία", "Αντιμετώπιση στρες "],
    title: "Θεραπεία κατά της κατάθλιψης και της άγχους",
    content:
      "Αυτή η υπηρεσία απευθύνεται σε άτομα που αντιμετωπίζουν κατάθλιψη, άγχος και άλλες ψυχολογικές προκλήσεις. Ο κλινικός ψυχολόγος παρέχει υποστήριξη, αξιολογεί την κατάσταση και αναπτύσσει μαζί με τον πελάτη στρατηγικές θεραπείας που βοηθούν στην αντιμετώπιση και την ανακούφιση από τα συμπτώματα.",
    coupon: "-20% Online",
  },
  {
    id: 4,
    tags: ["Ευεξία", "Αυτογνωσία"],
    title: "Συμβουλευτική σε ζητήματα προσωπικής ανάπτυξης",
    content:
      "Αυτή η υπηρεσία απευθύνεται σε όσους επιθυμούν να βελτιώσουν τον εαυτό τους και να αναπτύξουν προσωπικά. Ο κλινικός ψυχολόγος παρέχει συμβουλές και τεχνικές για την ανάπτυξη των δεξιοτήτων τους, την αύξηση της αυτοεκτίμησης και την επίτευξη προσωπικών στόχων.",
    coupon: "-20% Online",
  },
];

export { services };
